In [1]:
import pandas as pd
import numpy as np

In [4]:
# Create dataset
#df = pd.DataFrame(np.arange(12).reshape(3, 4),columns=['A', 'B', 'C', 'D'])

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [20]:
# data = {'Name':['Tom', 'nick', 'krish', 'jack'],'Age':[20, 21, 19, 18]}
df = {'time_point':[1,1,1,1,1,2,2,2,2,2],'city':['Valencia','Barcelona','Madrid','Bilboa','Seville','Valencia','Barcelona','Madrid','Bilboa','Seville'],'value':[5,6,7,8,4,8,3,7,8,2]}

In [21]:
df

{'time_point': [1, 1, 1, 1, 1, 2, 2, 2, 2, 2],
 'city': ['Valencia',
  'Barcelona',
  'Madrid',
  'Bilboa',
  'Seville',
  'Valencia',
  'Barcelona',
  'Madrid',
  'Bilboa',
  'Seville'],
 'value': [5, 6, 7, 8, 4, 8, 3, 7, 8, 2]}

In [22]:
data= pd.DataFrame(df)

In [23]:
data

   time_point       city  value
0           1   Valencia      5
1           1  Barcelona      6
2           1     Madrid      7
3           1     Bilboa      8
4           1    Seville      4
5           2   Valencia      8
6           2  Barcelona      3
7           2     Madrid      7
8           2     Bilboa      8
9           2    Seville      2

In [28]:
print data.mean()
# x   -0.163044
# y    2.120000
# dtype: float64

SyntaxError: invalid syntax (<ipython-input-28-953a6f7b4f4b>, line 1)

In [24]:
values = data['value']
time_points = data['time_point']
for i in data:
    if data['time_point'] = i:
        spain = np.mean(values)
    return spain

SyntaxError: invalid syntax (<ipython-input-24-892d71640e97>, line 4)

In [27]:
for i in data:
    if data['time_point'] [i] = [i]:
        spain = data['value'].mean()
    return spain

SyntaxError: invalid syntax (<ipython-input-27-eec0fff96050>, line 2)

In [ ]:
for i in data:
    if data.loc[data['time_point'][i] == [i]:
                data['value'][i] =

In [37]:
import numpy as np
import pandas as pd

# some random data frames
df1 = pd.DataFrame(dict(x=np.random.randn(100), y=np.random.randint(0, 5, 100)))
df2 = pd.DataFrame(dict(x=np.random.randn(100), y=np.random.randint(0, 5, 100)))

# concatenate them
df_concat = pd.concat((df1, df2))

print(df_concat.mean())
# x   -0.163044
# y    2.120000
# dtype: float64

#print df_concat.median()
# x   -0.192037
# y    2.000000
# dtype: float64

x    0.143406
y    2.110000
dtype: float64

In [30]:
df1.head()

          x  y
0  1.536485  1
1  0.705078  1
2  1.283196  4
3 -0.771659  3
4 -0.409526  1

In [32]:
df2.head()

          x  y
0 -0.440088  1
1  0.609318  4
2 -1.231486  3
3  0.498003  2
4 -0.352635  1

In [35]:
df_concat.head()

          x  y
0 -1.855768  1
1 -1.041438  1
2 -0.653893  0
3 -0.922867  2
4  0.572767  3